# Используем базовый образ с Node.js
FROM node:alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы из текущей директории (кроме тех, которые указаны в .dockerignore) в рабочую директорию внутри контейнера
COPY . .

# Собираем статические файлы React
RUN npm run build

# Команда, которая будет запущена при старте контейнера
CMD ["npm", "start"]